function C=Malthus(j)
%%Malthus模型指数预测
t=2000:2023;
x(t)=[126743 127627 128453 129227 129988 130756 131448 132129 132802 133450 134091 134735 135404 136072 136782 137462 138271 139008 140541 141008 141178 141260 141175 140967];
y=log(x(t));
a=polyfit(t,y,1);
r=a(1);
x0=exp(a(2));
%拟合
x1=x0.*exp(r.*t);

t=2000:2023;
plot(t,x(t),'r*')
hold on
t=2000:2051;
x0=5.9329;
f(t)=x0*exp(0.0050*t);
plot(t,f(t),'b')
grid on      %网格线
xlabel('年份')
ylabel('中国人口数量/万人')
legend('中国人口实际数量','预测中国人口数量')

year=2024:2051;
c=f(year);
C=j.*c;
end